from Practice.utils import my_print

# ----------------------------------------------------------------------------------------------------------------
task = "Провести дисперсионный анализ для определения того,\n" \
       "есть ли различия среднего роста среди взрослых футболистов, хоккеистов и штангистов. \n" \
       "Даны значения роста в трех группах случайно выбранных спортсменов: \n" \
       "Футболисты: 173, 175, 180, 178, 177, 185, 183, 182. \n" \
       "Хоккеисты: 177, 179, 180, 188, 177, 172, 171, 184, 180. \n" \
       "Штангисты: 172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170."

my_print(msg=task, separator_before=True, separator_after=False, color='зеленый')